podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CAN0_MKE16F16.svd.xml
            <register>
               <name>PL1_HI</name>
               <description>Pretended Networking payload High Filter 1 Register</description>
               <addressOffset>0xB18</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_7</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_6</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 6</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_5</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_4</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLT_ID2_IDMASK</name>
               <description>Pretended Networking ID Filter 2 Register / ID Mask Register</description>
               <addressOffset>0xB1C</addressOffset>
               <fields>
                  <field>
                     <name>FLT_ID2_IDMASK</name>
                     <description>ID Filter 2 for Pretended Networking Filtering / ID Mask Bits for Pretended Networking ID Filtering</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
                  <field>
                     <name>RTR_MSK</name>
                     <description>Remote Transmission Request Mask Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The corresponding bit in the filter is &quot;don&apos;t care&quot;</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The corresponding bit in the filter is checked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RTR_MSK" > <name>IDE_MSK</name> <description>ID Extended Mask Bit</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PL2_PLMASK_LO</name>
               <description>Pretended Networking payload Low Filter 2 Register / payload Low Mask Register</description>
               <addressOffset>0xB20</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_3</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_2</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_1</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_0</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PL2_PLMASK_HI</name>
               <description>Pretended Networking payload High Filter 2 low order bits / payload High Mask Register</description>
               <addressOffset>0xB24</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_7</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_6</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 6</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_5</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_4</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>$(WAKEUP_BUFFER_COUNT)</dim>
               <dimIncrement>16</dimIncrement>
               <name>WMB,@p@f@i</name>
               <addressOffset>0xB40</addressOffset>
               <register>
                  <name>WMBn_CS</name>
                  <description>Wake Up Message Buffer Register for C/S</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>DLC</name>
                        <description>Length of Data in Bytes</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Transmission Request Bit</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Frame is data one (not remote)</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Frame is a remote one</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>ID Extended Bit</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Frame format is standard</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Frame format is extended</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRR</name>
                        <description>Substitute Remote Request</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WMBn_ID</name>
                  <description>Wake Up Message Buffer Register for ID</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>ID</name>
                        <description>Received ID under Pretended Networking mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>29</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WMBn_D03</name>
                  <description>Wake Up Message Buffer Register for Data 0-3</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>Data_byte_3</name>
                        <description>Received payload corresponding to the data byte 3 under Pretended Networking mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_2</name>
                        <description>Received payload corresponding to the data byte 2 under Pretended Networking mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_1</name>
                        <description>Received payload corresponding to the data byte 1 under Pretended Networking mode</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_0</name>
                        <description>Received payload corresponding to the data byte 0 under Pretended Networking mode</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WMBn_D47</name>
                  <description>Wake Up Message Buffer Register Data 4-7</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>Data_byte_7</name>
                        <description>Received payload corresponding to the data byte 7 under Pretended Networking mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_6</name>
                        <description>Received payload corresponding to the data byte 6 under Pretended Networking mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_5</name>
                        <description>Received payload corresponding to the data byte 5 under Pretended Networking mode</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_4</name>
                        <description>Received payload corresponding to the data byte 4 under Pretended Networking mode</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
